tutorials/OF-RTM/IRTM_test/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions	[0 1 -1 0 0 0 0];

internalField	uniform (0 0 0);

boundaryField
{
inlet
	{
		type			fixedValue;		
		value			uniform (0.6666e-2 0 0); //new: U_inlet = u*porosity
	}
	
	outlet
	{
		type 			zeroGradient;
	}

	leftWall
	{
		type			fixedValue;		
		value			uniform (0 0 0);
	}
		
	rightWall
	{
		type			fixedValue;		
		value			uniform (0 0 0);
	}

	lowerWall
	{
		type			fixedValue;					
		value			uniform (0 0 0);
	}
		
	upperWall
	{
		type			fixedValue;		
		value			uniform (0 0 0);
	}
}
}


// ************************************************************************* //
