tutorials/OF-RTM/IRTM_test/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions	[1 -1 -2 0 0 0 0];

internalField	uniform 1e5;


boundaryField
{
	inlet
	{
		type	        	zeroGradient;
	}

	
	outlet
	{
		type	        	fixedValue;
		value 				$internalField;
	}

	    leftWall
	    {
		type	        	zeroGradient;
	    }
	    rightWall
	    {
		type	        	zeroGradient;
	    }

	    lowerWall
	    {
		type	        	zeroGradient;
	    }
	    upperWall
	    {
		type	        	zeroGradient;
	    }    
}


// ************************************************************************* //
