tutorials/OF-RTM/IRTM_test/constant/porosityProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      porosityProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

porosity1
{
    type            fiberDarcyForchheimer;
    active          yes;
    cellZone        "layer1";
	
	//Example
	/*
	DarcyForchheimerCoeffs
	{
		d       d [0 -2 0 0 0 0 0] (0.37e11 0.37e11 0.37e11);
        f       f [0 -1 0 0 0 0 0] (0 0 0);
		
		coordinateSystem
		{
			type    cartesian;
			origin  (0 0 0);
			coordinateRotation
			{
				type    axesRotation;
				e1      (0.70710678 0.70710678 0);
				e2      (0 0 1);
			}
		}
	}
	*/
	
    fiberDarcyForchheimerCoeffs
    {	
		
		// name of boundaries to calculate thickness direction from
		calcThickness false;
        thicknessWall upperWall;
        
		type Gebart;

		GebartCoeffs
		{
			vf0     0.5;
            vfmax   0.9;
            d       d [0 -2 0 0 0 0 0] (0.37e11 0.37e11 0.37e11);
            f       f [0 -1 0 0 0 0 0] (0 0 0);
		}       
	   
        tabularDataCoeffs
        {
            //type: exponential, linear, spline
            interpolation exponential;
            FVF (0.3333 0.338983051 0.344827586 0.350877193 0.357142857 0.363636364 0.37037037 0.377358491 0.384615385 0.392156863 0.4 0.408163265 0.416666667 0.425531915 0.434782609 0.444444444 0.454545455 0.465116279 0.476190476 0.487804878 0.5);			
            K1 (1.45136E-10 1.36753E-10 1.28682E-10 1.20872E-10 1.13322E-10 1.06032E-10 9.90005E-11 9.22275E-11 8.57119E-11 7.94528E-11 7.34494E-11 6.77006E-11 6.22053E-11 5.69624E-11 5.19705E-11 4.72283E-11 4.27342E-11 3.84866E-11 3.44837E-11 3.07233E-11 2.72035E-11);
            K2 (1.45136E-10 1.36753E-10 1.28682E-10 1.20872E-10 1.13322E-10 1.06032E-10 9.90005E-11 9.22275E-11 8.57119E-11 7.94528E-11 7.34494E-11 6.77006E-11 6.22053E-11 5.69624E-11 5.19705E-11 4.72283E-11 4.27342E-11 3.84866E-11 3.44837E-11 3.07233E-11 2.72035E-11);
            K3 (1.45136E-10 1.36753E-10 1.28682E-10 1.20872E-10 1.13322E-10 1.06032E-10 9.90005E-11 9.22275E-11 8.57119E-11 7.94528E-11 7.34494E-11 6.77006E-11 6.22053E-11 5.69624E-11 5.19705E-11 4.72283E-11 4.27342E-11 3.84866E-11 3.44837E-11 3.07233E-11 2.72035E-11);
        }        
        
        exponentialFunctionCoeffs
        {
            C01     1e-10;
            C02     1e-10;
            C03     1e-10;
            C11     1e-5;
            C12     1e-5;
            C13     1e-5;
        }
        
    }
}

// ************************************************************************* //
